// This query finds network communication to specific URL similar to the IP Lookup
// Please note that in line #7 it filters RemoteUrl using has operator, which looks for a "whole term" and runs faster.
// Example: RemoteUrl has "microsoft" matches "www.microsoft.com" but not "microsoftonline.com"
let partialRemoteUrlToDetect = "[insert word or URL here]"; // insert URL or keyword in between ""'s and remove []'s
DeviceNetworkEvents  
| where Timestamp > ago(30d)
and RemoteUrl has partialRemoteUrlToDetect // Can be changed to "contains" operator as explained above
| project Timestamp, RemoteUrl, DeviceName, DeviceId, InitiatingProcessAccountName, ReportId 
| top 100 by Timestamp desc
